<a href="https://colab.research.google.com/github/19PA1A0536/python-basics/blob/master/Untitled3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
a=np.array(["s","a","i"])
b=pd.Series(a)
b

0    s
1    a
2    i
dtype: object

In [0]:
a=np.array(['t','r','i','l','o','k'])
b=pd.Series(a,index=[1,2,3,4,5,6])
b

1    t
2    r
3    i
4    l
5    o
6    k
dtype: object

In [0]:
df=pd.DataFrame([['1','trilok','marvel series'],['2','venkata','Janatha garage'],['3','naga','avengers end game'],['4','sai','songs']],columns=["number",'Name','Favourite movie'])
df

  number     Name    Favourite movie
0      1   trilok      marvel series
1      2  venkata     Janatha garage
2      3     naga  avengers end game
3      4      sai              songs

In [0]:
df1=pd.DataFrame([['1','trilok','marvel series'],['2','venkata','Janatha garage'],['3','naga','avengers'],['4','sai','songs']],columns=["number",'Name','Favourite movie'], dtype=float)
df1

   number     Name Favourite movie
0     1.0   trilok   marvel series
1     2.0  venkata  Janatha garage
2     3.0     naga        avengers
3     4.0      sai           songs

In [0]:
df=pd.DataFrame({'Roll number':['501','502','503','504'],'Name':['trilok','venkata','naga','sai']})
df

  Roll number     Name
0         501   trilok
1         502  venkata
2         503     naga
3         504      sai

In [0]:
import pandas as pd

dp2=pd.DataFrame([['Trilok','9.0','9.1'],['arif','9.2','8.9'],['gopa','9.8','9.7']],columns=['Name','SSC Marks','Inter Percentage'],dtype=float)
dp2

     Name  SSC Marks  Inter Percentage
0  Trilok        9.0               9.1
1    arif        9.2               8.9
2    gopa        9.8               9.7

In [0]:
dp1.T

                       0     1     2
Name              Trilok  arif  gopa
SSC Marks              9   9.2   9.8
Inter Percentage     9.1   8.9   9.7

In [0]:
dp1.loc[0]

Name                Trilok
SSC Marks                9
Inter Percentage       9.1
Name: 0, dtype: object

In [0]:
dp1.loc[0:1]

     Name  SSC Marks  Inter Percentage
0  Trilok        9.0               9.1
1    arif        9.2               8.9

In [0]:
del dp1["SSC Marks"]
dp1

     Name  Inter Percentage
0  Trilok               9.1
1    arif               8.9
2    gopa               9.7

In [0]:
dp1["Inter Percentage"].sum()

27.7

In [0]:
dp2 .describe(include="all")

          Name  SSC Marks  Inter Percentage
count        3   3.000000          3.000000
unique       3        NaN               NaN
top     Trilok        NaN               NaN
freq         1        NaN               NaN
mean       NaN   9.333333          9.233333
std        NaN   0.416333          0.416333
min        NaN   9.000000          8.900000
25%        NaN   9.100000          9.000000
50%        NaN   9.200000          9.100000
75%        NaN   9.500000          9.400000
max        NaN   9.800000          9.700000

In [0]:
dp2.describe()

       SSC Marks  Inter Percentage
count   3.000000          3.000000
mean    9.333333          9.233333
std     0.416333          0.416333
min     9.000000          8.900000
25%     9.100000          9.000000
50%     9.200000          9.100000
75%     9.500000          9.400000
max     9.800000          9.700000

In [0]:
import pandas as pd
import numpy as np
sai=pd.DataFrame(np.random.randn(7,4),columns=['1','2','3','4'])
sai

          1         2         3         4
0  1.325866  1.122883  0.083973  0.678488
1  1.379091 -0.280746 -1.364135  1.179257
2  0.915684  1.448994 -0.046291 -2.060662
3  0.098861  1.014265  0.465173 -0.331409
4 -1.303379 -0.694096  0.885686  0.966015
5  1.852321 -0.807848  0.095635 -0.061706
6  0.094946  0.133350 -0.716183  0.636129

In [0]:

nag=pd.DataFrame(np.random.randn(8,4),columns=["1","2","3","4"])
nag

          1         2         3         4
0  0.798884 -2.427502 -0.301609  2.443561
1  1.258579 -1.350294  0.662552  0.278378
2 -0.818872 -0.615759  0.341420 -0.209401
3  1.698099  0.761906  0.566671  1.537857
4  0.592785 -0.967206 -3.067036 -1.737094
5  0.106345 -0.164637 -0.733847  0.070236
6  0.480786  1.212500  0.679367  1.852027
7  1.235253  0.331347  0.953169 -1.405363

In [0]:
sai=sai.reindex_like(nag)
sai

          1         2         3         4
0  1.325866  1.122883  0.083973  0.678488
1  1.379091 -0.280746 -1.364135  1.179257
2  0.915684  1.448994 -0.046291 -2.060662
3  0.098861  1.014265  0.465173 -0.331409
4 -1.303379 -0.694096  0.885686  0.966015
5  1.852321 -0.807848  0.095635 -0.061706
6  0.094946  0.133350 -0.716183  0.636129
7       NaN       NaN       NaN       NaN